{
  "version": "2.1",
  "description": "Expanded Role prototype sentences for multi-sample semantic matching. Optimized for Finance and Academic texts.",
  "prototypes": {
    "definition": {
      "description": "Formal definitions of concepts, terms, or entities",
      "examples": [
        "A bond is a financial instrument that represents a loan made by an investor.",
        "The yield to maturity is defined as the internal rate of return of the bond.",
        "Duration measures the sensitivity of bond price to interest rate changes.",
        "The term 'arbitrage' refers to the simultaneous purchase and sale of an asset.",
        "A derivative is a financial contract whose value is derived from an underlying asset.",
        "Equity represents the residual interest in the assets of an entity after deducting liabilities.",
        "Beta is a measure of the volatility or systematic risk of a security compared to the market.",
        "The plowback ratio is the proportion of earnings retained in the business.",
        "Net asset value (NAV) is the market value of the assets held by a fund minus its liabilities.",
        "A call option gives the holder the right to buy an asset at a specified price."
      ]
    },
    "assumption": {
      "description": "Prerequisites, conditions, or hypothetical scenarios",
      "examples": [
        "Assume that the interest rate remains constant over the investment period.",
        "Let us suppose that the market is efficient and all information is reflected in prices.",
        "Given that inflation is zero, the nominal rate equals the real rate.",
        "Suppose the investor has a risk-free investment opportunity available.",
        "Under the assumption of no transaction costs, the arbitrage condition holds.",
        "Assuming that dividends grow at a constant rate forever, we can use the Gordon model.",
        "Let x denote the initial price and y denote the terminal value.",
        "We assume for simplicity that the corporate tax rate is negligible.",
        "Consider a world with two assets: a risky stock and a risk-free bond.",
        "If we hold the volatility constant, the option price becomes a linear function of time."
      ]
    },
    "limitation": {
      "description": "Constraints, caveats, or boundaries of applicability",
      "examples": [
        "This model does not account for transaction costs or taxes.",
        "The analysis is limited to the case where default risk is negligible.",
        "One caveat is that liquidity may vary significantly across different securities.",
        "The results only apply to investment-grade bonds and may not generalize.",
        "This approach fails when market conditions become highly volatile.",
        "The results are sensitive to the chosen parameters and may change significantly.",
        "This approach assumes market liquidity which may not exist during systemic crises.",
        "The model fails to account for idiosyncratic factors that affect individual stock price movements.",
        "These conclusions are limited by the small sample size and specific time period studied.",
        "One significant caveat is that transaction costs can erode the theoretical arbitrage profits.",
        "The empirical validity of this theory has been questioned in several recent studies.",
        "Applying this historically derived relationship to the future involves considerable risk.",
        "This formula is valid only when the growth rate is strictly less than the discount rate."
      ]
    },
    "mechanism": {
      "description": "Explanations of how something works or processes operate",
      "examples": [
        "When interest rates rise, bond prices fall because the present value decreases.",
        "The arbitrage mechanism ensures that prices converge to their fair value.",
        "Duration works by measuring the weighted average time of cash flows.",
        "The central bank influences short-term rates through open market operations.",
        "Price discovery occurs through the interaction of buyers and sellers in the market.",
        "The margin call process protects the broker against potential losses from price fluctuations.",
        "Hedging works by taking an offsetting position in a related security.",
        "An increase in the supply of Treasury bills tends to drive up short-term interest rates.",
        "The clearinghouse acts as the buyer to every seller and the seller to every buyer.",
        "Quantitative easing works by lowering long-term interest rates through asset purchases."
      ]
    },
    "procedure": {
      "description": "Step-by-step instructions or methodologies",
      "examples": [
        "First, calculate the present value of each cash flow. Then sum all values.",
        "To compute the yield, solve the equation iteratively until convergence.",
        "Follow these steps: enter the data, run the model, and interpret results.",
        "Begin by identifying the relevant cash flows, then discount each to present value.",
        "Step 1: Gather the required inputs. Step 2: Apply the formula. Step 3: Verify the result.",
        "Click the Downloads tab and register for a free account to access the data.",
        "Use the spreadsheet tool to input the historical prices and calculate the rolling beta.",
        "Divide the annual coupon by the current market price to find the current yield.",
        "To perform the immunization, match the duration of your assets with your liabilities.",
        "Calculate the standard deviation of excess returns to find the Sharpe ratio."
      ]
    },
    "evidence": {
      "description": "Data, statistics, empirical findings, or measurements",
      "examples": [
        "The correlation coefficient was 0.85, indicating a strong positive relationship.",
        "Returns increased by 15% over the sample period from 2010 to 2020.",
        "Statistical analysis shows p < 0.05, rejecting the null hypothesis.",
        "The average yield was 4.5% with a standard deviation of 1.2%.",
        "Historical data indicates that credit spreads widen during recessions by an average of 200 basis points.",
        "Figure 17.1 illustrates the change in purchasing power relative to the dollar.",
        "Table 2.1 shows that the S&P 500 outperformed the bond index in 8 out of 10 years.",
        "Empirical studies find that high-beta stocks do not always provide the expected risk premium.",
        "The fund has achieved an annualized return of 12.4% since its inception in 2005.",
        "French economy grew at a rate of 6.1% in 2021, nearly double the German rate."
      ]
    },
    "example": {
      "description": "Illustrative instances, case studies, or demonstrations",
      "examples": [
        "For instance, consider a 10-year bond with a 5% coupon rate.",
        "An example would be the 2008 financial crisis when credit spreads widened.",
        "To illustrate, suppose an investor purchases $1,000 worth of Treasury bonds.",
        "Consider the case of a company issuing convertible bonds to raise capital.",
        "As an illustration, let's examine a portfolio with equal weights in stocks and bonds.",
        "Such as a pension fund that uses an immunization strategy to meet its future obligations.",
        "Like the CAPM, the APT predicts a security market line linking expected returns to risk.",
        "Take the case of Microsoft, which issued 30-year bonds during a low-interest rate environment.",
        "Imagine an investor who believes the stock market is about to undergo a correction.",
        "For example, a high-frequency trader might exploit nanosecond price discrepancies."
      ]
    },
    "interpretation": {
      "description": "Explanations of meaning, implications, or significance",
      "examples": [
        "This means that investors are willing to accept lower returns for safety.",
        "In other words, the market is pricing in a higher probability of default.",
        "The implication is that portfolio diversification reduces overall risk.",
        "This result suggests that interest rate risk is the dominant factor.",
        "What this indicates is that the model captures the essential dynamics accurately.",
        "This finding implies that active management may be difficult for most investors.",
        "Essentially, the premium reflects the compensation for bearing systematic risk.",
        "This can be interpreted as a sign of increasing market uncertainty.",
        "It follows that the risk-neutral probability of an upward move must be exactly p.",
        "The evidence points to a strong influence of behavioral biases on stock prices."
      ]
    },
    "conclusion": {
      "description": "Summary statements, takeaways, or final recommendations",
      "examples": [
        "In conclusion, duration matching is an effective immunization strategy.",
        "Therefore, we recommend a barbell strategy for this interest rate environment.",
        "The key takeaway is that credit risk dominates during economic downturns.",
        "To summarize, diversification remains the most reliable risk management tool.",
        "In summary, the evidence supports a cautious approach to credit exposure.",
        "Ultimately, the goal of the firm is to maximize shareholder wealth.",
        "Hence, the efficient market hypothesis remains a useful benchmark for performance.",
        "Final results confirm that the strategy outperformed the passive index over the long term.",
        "Overall, the integration of ESG factors can enhance long-term risk-adjusted returns.",
        "Consequently, investors should rebalance their portfolios at least annually."
      ]
    },
    "comparison": {
      "description": "Comparative statements between concepts or entities",
      "examples": [
        "Unlike stocks, bonds provide fixed income streams to investors.",
        "Compared to Treasury bonds, corporate bonds offer higher yields but more risk.",
        "The longer-duration portfolio outperformed the shorter-duration one.",
        "In contrast to passive strategies, active management requires higher fees.",
        "Whereas government bonds are considered risk-free, corporate bonds carry default risk.",
        "Small-cap stocks have historically provided higher returns than large-cap stocks.",
        "Growth stocks differ from value stocks in their P/E ratios and expected earnings rates.",
        "Standard deviation measures total risk, whereas beta measures only systematic risk.",
        "Futures contracts are standardized, unlike forward contracts which are private agreements.",
        "Real assets like land have intrinsic value, in contrast to financial assets which are paper claims."
      ]
    },
    "application": {
      "description": "Practical use cases or real-world implementations",
      "examples": [
        "This technique is commonly used by pension funds to match liabilities.",
        "In practice, traders use this model for pricing interest rate swaps.",
        "Portfolio managers apply this framework when constructing fixed income portfolios.",
        "The method is widely adopted in the insurance industry for asset-liability management.",
        "Real-world applications include hedging strategies and risk assessment.",
        "Many professional investors utilize this metric to screen for undervalued securities.",
        "The strategy can be implemented using exchange-traded funds (ETFs) for lower costs.",
        "Commercial banks apply these credit scoring models when evaluating loan applications.",
        "This concept is essential for anyone managing a multi-asset investment portfolio.",
        "Corporate treasurers use futures to lock in interest rates for future debt issuance."
      ]
    }
  },
  "usage_notes": [
    "These prototypes are embedded using Sentence-BERT and stored as matrices per role.",
    "The refined matching logic uses Max-Similarity (Nearest Neighbor) against the support set.",
    "The 2.1 update includes 130+ diverse samples specifically focused on Finance and Research Discourse.",
    "If 'max_similarity' exceeds the threshold (default 0.75), the role is updated to the best matching category."
  ]
}